Revit 2027 API
Entity Constructor
Overload List
Name | Description
Entity() |  The default-constructed Entity is invalid.
Entity(Entity) |  Constructs a new copy of the input ESEntity object.
Entity(Guid) |  Creates a new Entity corresponding to the Schema of the specified GUID.
Entity(Schema) |  Creates a new Entity corresponding to the Schema.
Top
See Also
Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace